a = {
    "ID (номер по списку)": 5,
    "прізвище": "Drohom",
    "Ім’я": "Roman",
    "Група": "IPZ-23-2",
    "Курс": 1,
    "Книги (борг) - список": [],
    "Статистика книг – список": []
}
b = int(input("Введіть число 1/2/3: "))
while b != 0:
    if b == 1:
        print(a)
    elif b == 2:
        book=input("Введіть назву книги яку бажаєте взяти в борг:")
        a ["Книги (борг) - список"].append(book)
        print(f"Книга '{book}' додана до списку боргу.")
    elif b == 3:
        book=input("Введіть назву книги яку бажаєте повернути:")
        back = a["Книги (борг) - список"]
        if book not in back:
            print("У вас немає взятих книг.")
        else:
            a["Статистика книг – список"].append(book)
            back.remove(book)
            print("Книга '{book}' у статистиці.")
            
    
    b = int(input("Введіть число 1/2/3: "))
